"""
整数: python中可以对整数进行加(+)、减(-)、乘(*)、除(*)、整除("\\")、乘方(**)、取模(%)、左移(<<)、右移(>>)运算
可以使用括号修改计算顺序
可以用下划线分割数
"""
a = 1 + 2
b = 2 - 1
c = 2 * 3
d = 4 / 2
e = 2 ** 4
f = 3 // 2
g = 7 % 3
h = 8 << 1
I = 8 >> 1
print(f"{a=} {b=} {c=} {d=} {e=} {f=} {g=} {h=} {I=}")
demo = 2 + 3 * 4
print(f"{demo=}")
demo = (2 + 3) * 4
print(f"{demo=}")
demo = 3_000_000_000
print(f"{demo=}")
demo = 3_000_000.98
print(f"{demo=}")
"""
浮点数: 带小数点的数
除法的结果总是浮点数
参与运算的数有浮点数，那么结果也总是浮点数
"""
test_1 = 1 + 0.3
test_2 = 4 / 2
print(f"{test_1=}")
print(f"{test_2=}")